const handler = async (m, {conn, usedPrefix}) => {
  const pp = imagen4;
  try {
  } catch (e) {
  } finally {
    const name = await conn.getName(m.sender);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const str = `
┏━━━━━━━━━━━━━━━━┓
┃ ✦⏤͟͟͞͞ᴄᴀᴊᴀ ғᴜᴇʀᴛᴇ⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

              ♥︎иαgιѕα🤖⃞⃟⃠♥︎

┣[☆🖥 ᴇɴ ᴇsᴛᴇ ᴍᴇɴᴜ ᴘᴜᴇᴅᴇs ɢᴜᴀʀᴅᴀʀ ᴛᴜs ᴍᴇɴsᴀᴊᴇs ᴇ ᴀᴜᴅɪᴏs ɪᴍᴘᴏʀᴛᴀɴᴛᴇs.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ᴀɢʀᴇɢᴀʀ ᴀ ʟᴀ ʟɪsᴛᴀ⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  ᴀɢʀᴇɢᴀʀᴍsɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚝𝚎𝚡𝚝𝚘).
┣[☆🗒  ᴀɢʀᴇɢᴀʀᴠɴ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚗𝚘𝚝𝚊 𝚍𝚎 𝚟𝚘𝚣).
┣[☆🗒  ᴀɢʀᴇɢᴀʀᴠɪᴅᴇᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚟𝚒𝚍𝚎𝚘).
┣[☆🗒  ᴀɢʀᴇɢᴀʀᴀᴜᴅɪᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚊𝚞𝚍𝚒𝚘).
┣[☆🗒  ᴀɢʀᴇɢᴀʀɪᴍɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚒𝚖𝚊𝚐𝚎𝚗).
┣[☆🗒  ᴀɢʀᴇɢᴀʀsᴛɪᴄᴋᴇʀ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞ɴ 𝚜𝚝𝚒𝚌𝚔𝚎𝚛).

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ʟɪsᴛᴀ ᴅᴇ ᴄᴏᴍᴀɴᴅᴏs⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒 ʟɪsᴛᴀᴍsɢ.
┣[☆🗒 ʟɪsᴛᴀᴠɴ.
┣[☆🗒 ʟɪsᴛᴀᴠɪᴅᴇᴏ.
┣[☆🗒 ʟɪsᴛᴀᴀᴜᴅɪᴏ.
┣[☆🗒 ʟɪsᴛᴀɪᴍɢ.
┣[☆🗒 ʟɪsᴛᴀsᴛɪᴄᴋᴇʀ.

┏━━━━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ᴠᴇʀ ᴛᴇxᴛᴏsᴀʀᴄʜɪᴠᴏs⏤͟͟͞͞✦
┗━━━━━━━━━━━━━━━━━━

┣[☆🗒  ᴠᴇʀᴍsɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴠᴇʀᴠɴ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴠᴇʀᴠɪᴅᴇᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴠᴇʀᴀᴜᴅɪᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴠᴇʀɪᴍɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴠᴇʀsᴛɪᴄᴋᴇʀ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ ᴇʟɪᴍɪɴᴀʀ⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  ᴇʟɪᴍɪɴᴀʀᴍsɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴇʟɪᴍɪɴᴀʀᴠɴ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴇʟɪᴍɪɴᴀʀᴠɪᴅᴇᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴇʟɪᴍɪɴᴀʀᴀᴜᴅɪᴏ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴇʟɪᴍɪɴᴀʀɪᴍɢ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  ᴇʟɪᴍɪɴᴀʀsᴛɪᴄᴋᴇʀ 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎  .
┗━━━━━━━━━━━━━

┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.`.trim();
    if (m.isGroup) {
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
    // conn.sendButton(m.chat, str, wm, pp, [['𝙼𝙴𝙽𝚄 𝙿𝚁𝙸𝙽𝙲𝙸𝙿𝙰𝙻', '/menu']], m, { mentions: [m.sender] })
  }
};
handler.help = ['cajafuerte'];
handler.tags = ['owner'];
handler.command = /^(cajafuerte)$/i;
handler.rowner = true;
handler.fail = null;
export default handler;
